# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aks.azurerm_monitor_diagnostic_setting.aks will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "aks" {
        id                             = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks|AKS-Diagnostics"
        name                           = "AKS-Diagnostics"
        # (6 unchanged attributes hidden)

      + enabled_metric {
          + category = "AllMetrics"
        }

        # (2 unchanged blocks hidden)
    }

  # module.dis_apim_test.azapi_resource.dis_apim_operator is tainted, so must be replaced
-/+ resource "azapi_resource" "dis_apim_operator" {
      ~ id                        = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-rg/providers/Microsoft.ContainerService/managedClusters/admin-test-aks/providers/Microsoft.KubernetesConfiguration/fluxConfigurations/dis-apim-altinn-apim-test-apim" -> (known after apply)
        name                      = "dis-apim-altinn-apim-test-apim"
      ~ output                    = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.observability.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.observability.azurerm_key_vault.obs_kv will be updated in-place
  ~ resource "azurerm_key_vault" "obs_kv" {
        id                              = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-obs-rg/providers/Microsoft.KeyVault/vaults/obs-admin-test-cayvkP"
        name                            = "obs-admin-test-cayvkP"
        tags                            = {}
      ~ tenant_id                       = (sensitive value)
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.observability.azurerm_role_assignment.ci_kv_secrets_role will be created
  + resource "azurerm_role_assignment" "ci_kv_secrets_role" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/admin-test-obs-rg/providers/Microsoft.KeyVault/vaults/obs-admin-test-cayvkP"
      + skip_service_principal_aad_check = true
    }

  # module.observability.azurerm_role_assignment.kv_reader_lakmus must be replaced
-/+ resource "azurerm_role_assignment" "kv_reader_lakmus" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleAssignments/6856c614-bbb1-eef6-94c1-d578afe665ac" -> (known after apply)
      ~ name                                   = "6856c614-bbb1-eef6-94c1-d578afe665ac" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/21090545-7ca7-4776-b22c-e363652d74d2" -> (known after apply)
      ~ scope                                  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @`tjololo` |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/admin-test-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/admin-test-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_admin-test-aks-rg.tfstate.tfplan` |